nc: 80  # number of classes

backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128]]   # 0-P2/4, 只传一个参数
  - [-1, 3, VSSBlock_YOLO, [128]]  # 1, 只传一个参数
  - [-1, 1, VisionClueMerge, [256]]  # 2 p3/8, 只传一个参数
  - [-1, 3, VSSBlock_YOLO, [256]]  # 3, 只传一个参数
  - [-1, 1, VisionClueMerge, [512]]  # 4 p4/16, 只传一个参数
  - [-1, 9, VSSBlock_YOLO, [512]]  # 5, 只传一个参数
  - [-1, 1, VisionClueMerge, [1024]]  # 6 p5/32, 只传一个参数
  - [-1, 3, VSSBlock_YOLO, [1024]]  # 7, 只传一个参数
  - [-1, 1, SPPF, [1024, 5]]  # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]  # 只传一个参数

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [256]]  # 只传一个参数

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]  # 只传一个参数

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [1024]]  # 只传一个参数

  - [[14, 17, 20], 1, Detect, [nc]]