# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv8 object detection model with P2/4 - P5/32 outputs and BIFPN

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9

# YOLOv8.0-p2 head with BIFPN
head:
  # Feature input layers
  - [1, 1, Conv, [256, 1, 1]]  # 10: P2 -> 256
  - [3, 1, Conv, [256, 1, 1]]  # 11: P3 -> 256
  - [5, 1, Conv, [256, 1, 1]]  # 12: P4 -> 256
  - [9, 1, Conv, [256, 1, 1]]  # 13: P5 -> 256

  # Top-down path
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [12, 14, 1, BiFPN_Concat2, [256, 2]]          # 15

  - [15, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [11, 16, 1, BiFPN_Concat2k, [256, 2]]          # 17

  - [17, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [10, 18, 1, BiFPN_Concat2, [256, 2]]          # 19

  # Bottom-up path
  - [19, 1, Conv, [256, 3, 2]]  # 20
  - [17, 20, 1, BiFPN_Concat2, [256, 2]]          # 21

  - [21, 1, Conv, [256, 3, 2]]  # 22
  - [15, 22, 1, BiFPN_Concat2, [256, 2]]          # 23

  - [23, 1, Conv, [256, 3, 2]]  # 24
  - [13, 24, 1, BiFPN_Concat2, [256, 2]]          # 25

  # Detect head
  - [19, 21, 23, 25, 1, Detect, [nc]]  # Output layers