# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics RT-DETR-ResNet50 with P2-P3 fusion for small objects
# Parameters
nc: 80 # number of classes
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4-P2/4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  # P2-P3 fusion only
  - [4, 1, Conv, [128, 1, 1]]  # 8, P2 projection
  - [5, 1, Conv, [128, 1, 1]]  # 9, P3 projection
  - [[8, 9], 1, Concat, [1]]   # 10, concat P2 and P3
  - [-1, 3, RepC3, [256, 0.5]] # 11, fused P2-P3 features

  # Original FPN structure with enhanced P3
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 13
  - [-1, 1, Conv, [256, 1, 1]]  # 14, Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 16 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 17
  - [-1, 3, RepC3, [256, 0.5]]  # 18, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 19, Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 20
  - [[11, -1], 1, Concat, [1]]  # 21 cat fused P2-P3
  - [-1, 3, RepC3, [256, 0.5]]    # X3 (22), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]   # 23, downsample_convs.0
  - [[-1, 19], 1, Concat, [1]]  # 24 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]    # F4 (25), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]   # 26, downsample_convs.1
  - [[-1, 14], 1, Concat, [1]]  # 27 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]    # F5 (28), pan_blocks.1

  - [[22, 25, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)