# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Enhanced RT-DETR with P2 small object detection head and lightweight optimization

# Parameters
nc: 80  # number of classes
scales:
  l: [1.00, 1.00, 1024]

# Lightweight Backbone with enhanced feature extraction for small objects
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]  # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]  # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]  # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]  # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]  # 4-P2/4 (enhanced for small objects)
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]  # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]  # 7-P5/32

# Enhanced Head with P2 detection and lightweight optimization
head:
  # Main branch processing (P5)
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]  # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  # P4 branch
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 input_proj.1
  - [[-2, -1], 1, Concat, [1]]  # 13
  - [-1, 2, RepC3, [256, 0.5]]  # 14, fpn_blocks.0 (reduced from 3 to 2 for lightweight)

  # P3 branch
  - [-1, 1, Conv, [256, 1, 1]]  # 15, Y4, lateral_convs.1
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 17 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 18 cat backbone P3
  - [-1, 2, RepC3, [256, 0.5]]  # X3 (19), fpn_blocks.1 (reduced from 3 to 2 for lightweight)

  # 🆕 P2 Small Object Detection Branch - Lightweight
  - [-1, 1, Conv, [192, 1, 1]]  # 20, P3 to P2 lateral_conv (reduced channels for lightweight)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 21
  - [4, 1, Conv, [192, 1, 1, None, 1, 1, False]]  # 22 input_proj for P2 (backbone layer 4)
  - [[-2, -1], 1, Concat, [1]]  # 23
  - [-1, 2, RepC3, [192, 0.5]]  # X2 (24), fpn_blocks.2 for P2 (lightweight, reduced channels)

  # Downsample paths with lightweight optimization
  # P3 to P4
  - [-1, 1, Conv, [192, 3, 2]]  # 25, downsample_convs.0 (reduced channels)
  - [[-1, 15], 1, Concat, [1]]  # 26 cat with P3 branch (Y4)
  - [-1, 2, RepC3, [256, 0.5]]  # F4 (27), pan_blocks.0 (reduced repetitions)

  # P4 to P5
  - [-1, 1, Conv, [256, 3, 2]]  # 28, downsample_convs.1
  - [[-1, 10], 1, Concat, [1]]  # 29 cat Y5
  - [-1, 2, RepC3, [256, 0.5]]  # F5 (30), pan_blocks.1 (reduced repetitions)

  # 🆕 Additional downsample from P2 to P3 for better feature fusion
  - [24, 1, Conv, [192, 3, 2]]  # 31, downsample from P2 to P3
  - [[-1, 19], 1, Concat, [1]]  # 32 cat with X3
  - [-1, 2, RepC3, [256, 0.5]]  # Enhanced X3 (33)

  # Detection head with P2, P3, P4, P5 - optimized for small objects
  - [[24, 33, 27, 30], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 4]]]  # Detect(P2, P3, P4, P5)