# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P2/4 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, number, module, args]
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] # 0-P1/2
  - [ -1, 1, HWD, [ 128, 3, 2 ] ] # 1-P2/4
  - [ -1, 2, C3k2, [ 256, False, 0.25 ] ] # 2
  - [ -1, 1, HWD, [ 256, 3, 2 ] ] # 3-P3/8
  - [ -1, 2, C3k2, [ 512, False, 0.25 ] ] # 4
  - [ -1, 1, HWD, [ 512, 3, 2 ] ] # 5-P4/16
  - [ -1, 2, C3k2, [ 512, True ] ] # 6
  - [ -1, 1, HWD, [ 1024, 3, 2 ] ] # 7-P5/32
  - [ -1, 2, C3k2, [ 1024, True ] ] # 8
  - [ -1, 1, AIFI, [ 1024, 8 ] ] # 9
  - [ -1, 2, C2PSA, [ 1024 ] ] # 10


# CCFM Neck + P2 Head
head:
   # --- 自顶向下路径 (Top-down) ---
  - [-1, 1, Conv, [512, 1, 1]]                   # 10, 从SPPF输出
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 11, P5->P4
  - [[-1, 6], 1, Concat, [1]]                  # 12, concat backbone P4
  - [-1, 3, C3k2, [512, False]]                   # 13, P4特征

  - [-1, 1, Conv, [256, 1, 1]]                   # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 15, P4->P3
  - [[-1, 4], 1, Concat, [1]]                    # 16, concat backbone P3
  - [-1, 3, C3k2, [256, False]]                    # 17, P3特征 (for detection)

   # --- 增加P2检测头的路径 ---
  - [-1, 1, Conv, [128, 1, 1]]                   # 18
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 19, P3->P2
  - [[-1, 2], 1, Concat, [1]]                    # 20, concat backbone P2
  - [-1, 3, C3k2, [128, False]]                    # 21, P2特征 (for detection)

   # --- 自底向上路径 (Bottom-up) ---
  - [-1, 1, Conv, [128, 3, 2]]                   # 22, P2->P3
  - [[-1, 18], 1, Concat, [1]]                  # 23, concat with P3 features
  - [-1, 3, C3k2, [256, False]]                    # 24, P3特征 (for detection)

  - [-1, 1, Conv, [256, 3, 2]]                   # 25, P3->P4
  - [[-1, 14], 1, Concat, [1]]                   # 26, concat with P4 features
  - [-1, 3, C3k2, [512, False]]                    # 27, P4特征 (for detection)

   # --- 检测头 ---
   # 论文中提到移除了P5大目标检测头，并增加了P2小目标检测头
   # 最终的检测层接收来自 P2, P3, P4 三个尺度的特征
  - [[22, 25, 28], 1, Detect, [nc]]              # 28, Detect(P2, P3, P4) - 只传递nc参数