# Ultralytics YOLO11 with SwinTransformer - Simplified
nc: 80

backbone:
  - [-1, 1, SwinTransformer_Tiny, []]  # 0

head:
  # 简单连接SwinTransformer的输出
  - [0, 1, Conv, [256, 1, 1]]  # 1
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 2
  - [0, 1, Conv, [128, 1, 1]]  # 3
  - [[-1, 2], 1, Concat, [1]]  # 4
  - [-1, 3, C2f, [256]]  # 5 (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]  # 6
  - [[-1, 1], 1, Concat, [1]]  # 7
  - [-1, 3, C2f, [512]]  # 8 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]  # 9
  - [0, 1, Conv, [512, 1, 1]]  # 10
  - [[-1, 9], 1, Concat, [1]]  # 11
  - [-1, 3, C2f, [768]]  # 12 (P5/32)

  - [[5, 8, 12], 1, Detect, [nc]]  # Detect(P3, P4, P5)