# 轻量化版本 - 减少通道数
backbone:
  - [-1, 1, SwinTransformer_Tiny, []]  # 0
  - [0, 1, Conv, [128, 1, 1]]  # 1-P3/8
  - [0, 1, Conv, [256, 1, 1]]  # 2-P4/16
  - [0, 1, Conv, [512, 1, 1]]  # 3-P5/32
  - [-1, 1, SPPF, [512, 5]]    # 4

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 5
  - [[-1, 2], 1, Concat, [1]]  # 6
  - [-1, 2, C3k2, [256]]  # 7 (减少重复次数)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 8
  - [[-1, 1], 1, Concat, [1]]  # 9
  - [-1, 2, C3k2, [128]]  # 10

  - [-1, 1, Conv, [128, 3, 2]] # 11
  - [[-1, 7], 1, Concat, [1]]  # 12
  - [-1, 2, C3k2, [256]]  # 13

  - [-1, 1, Conv, [256, 3, 2]] # 14
  - [[-1, 4], 1, Concat, [1]]  # 15
  - [-1, 2, C3k2, [512]]  # 16

  - [[10, 13, 16], 1, Detect, [nc]]  # Detect(P3, P4, P5)