# YOLO11-MLLA for Small Objects
nc: 80

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, LightMLLABlock, [256, [80, 80], 8, 4.0]]  # 4 - MLLA增强
  - [-1, 1, C3k2, [512, False, 0.25]]  # 5
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 1, LightMLLABlock, [512, [40, 40], 16, 4.0]]  # 7 - MLLA增强
  - [-1, 1, C3k2, [512, True]]  # 8
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 1, LightMLLABlock, [1024, [20, 20], 32, 4.0]]  # 10 - MLLA增强
  - [-1, 1, C3k2, [1024, True]]  # 11
  - [-1, 1, SPPF, [1024, 5]]  # 12
  - [-1, 1, C2PSA, [1024]]  # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 8], 1, Concat, [1]]  # 15 - cat with P4
  - [-1, 2, C3k2, [512, False]]  # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 4], 1, Concat, [1]]  # 18 - cat with MLLA-enhanced P3
  - [-1, 2, C3k2, [256, False]]  # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]  # 20
  - [[-1, 16], 1, Concat, [1]]  # 21
  - [-1, 2, C3k2, [512, False]]  # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 23
  - [[-1, 13], 1, Concat, [1]]  # 24
  - [-1, 2, C3k2, [1024, True]]  # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)