# Ultralytics YOLO11 object detection model with SwinTransformer-Tiny backbone
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone with SwinTransformer-Tiny
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SwinTransformer_Tiny, []]  # 0 - SwinTransformer backbone
  # SwinTransformer输出多尺度特征，我们直接使用其输出

  # 添加SPPF层增强感受野
  - [-1, 1, SPPF, [1024, 5]]  # 1

# YOLO11 head
head:
  # 上采样路径 P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 2 P5->P4
  - [[-1, -2], 1, Concat, [1]]  # 3 这里需要根据SwinTransformer的实际输出层调整

  # 使用C3k2模块（YOLOv11的特色模块）
  - [-1, 3, C3k2, [512]]  # 4

  # 上采样路径 P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 5
  - [[-1, -3], 1, Concat, [1]]  # 6 这里需要根据SwinTransformer的实际输出层调整
  - [-1, 3, C3k2, [256]]  # 7 (P3/8-small)

  # 下采样路径 P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]] # 8
  - [[-1, 4], 1, Concat, [1]]  # 9
  - [-1, 3, C3k2, [512]]  # 10 (P4/16-medium)

  # 下采样路径 P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]] # 11
  - [[-1, 1], 1, Concat, [1]]  # 12
  - [-1, 3, C3k2, [1024]]  # 13 (P5/32-large)

  - [[7, 10, 13], 1, Detect, [nc]]  # Detect(P3, P4, P5)