# YOLO11n-Transformer for Small Objects - Corrected Version
nc: 80

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P2/4
  - [-1, 1, C3k2, [128, False, 0.25]]  # 2
  - [-1, 1, Conv, [128, 3, 2]]  # 3-P3/8
  - [-1, 1, C3k2, [256, False, 0.25]]  # 4
  - [-1, 1, Conv, [256, 3, 2]]  # 5-P4/16
  - [-1, 1, C3k2, [512, True]]  # 6
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 1, C3k2, [512, True]]  # 8
  - [-1, 1, SPPF, [512, 5]]  # 9
  - [-1, 1, AIFI, [512, 512, 4, 0.0, nn.GELU(), True]]  # 10 - Lightweight AIFI
  - [3, 1, Conv, [64, 1, 1]]  # 11 - High-res branch from P3 (index 3)

head:
  # 上采样路径 P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 (from 10)
  - [[-1, 6], 1, Concat, [1]]  # 13 - cat with P4 (index 6)
  - [-1, 1, C3k2, [256, False]]  # 14
  - [-1, 1, MSDeformAttn, [256, 3, 4, 4]]  # 15 - Light deformable attention

  # 上采样路径 P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16 (from 15)
  - [[-1, 11], 1, Concat, [1]]  # 17 - cat with high-res branch (index 11)
  - [-1, 1, C3k2, [128, False]]  # 18
  - [-1, 1, MSDeformAttn, [128, 4, 4, 4]]  # 19 - High-res attention

  # 下采样路径 P3 -> P4
  - [-1, 1, Conv, [128, 3, 2]]  # 20 (from 19)
  - [[-1, 14], 1, Concat, [1]]  # 21 - cat with P4 feature (index 14)
  - [-1, 1, C3k2, [256, False]]  # 22

  # 下采样路径 P4 -> P5
  - [-1, 1, Conv, [256, 3, 2]]  # 23 (from 22)
  - [[-1, 10], 1, Concat, [1]]  # 24 - cat with AIFI enhanced P5 (index 10)
  - [-1, 1, C3k2, [512, True]]  # 25

  # 检测头 - 使用三个增强的特征层
  - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3_enhanced, P4_enhanced, P5_enhanced)