# YOLOv11-RepViT 配置文件
nc: 80

# 使用RepViT作为backbone
backbone:
  type: repvit_m0_6  # 可选择不同规模的RepViT

# Head部分保持YOLOv11原样，但需要适配通道数
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, "stage3"], 1, Concat, [1]]  # 连接中间特征层
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, "stage2"], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, "stage4"], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [[16, 19, 22], 1, Detect, [nc]]