# Ultralytics YOLO11 with SwinTransformer-Tiny (简化版)
# Parameters
nc: 80

backbone:
  # [from, repeats, module, args]
  - [-1, 1, SwinTransformer_Tiny, []]  # 0

  # 自动获取SwinTransformer的特征图并调整
  - [0, 1, Conv, [256, 1, 1]]  # 1-P3
  - [0, 1, Conv, [512, 1, 1]]  # 2-P4
  - [0, 1, Conv, [1024, 1, 1]] # 3-P5
  - [-1, 1, SPPF, [1024, 5]]   # 4

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 5
  - [[-1, 2], 1, Concat, [1]]  # 6
  - [-1, 3, C3k2, [512]]  # 7

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 8
  - [[-1, 1], 1, Concat, [1]]  # 9
  - [-1, 3, C3k2, [256]]  # 10 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 11
  - [[-1, 7], 1, Concat, [1]]  # 12
  - [-1, 3, C3k2, [512]]  # 13 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 14
  - [[-1, 4], 1, Concat, [1]]  # 15
  - [-1, 3, C3k2, [1024]] # 16 (P5/32-large)

  - [[10, 13, 16], 1, Detect, [nc]]  # Detect(P3, P4, P5)