# Ultralytics YOLO11 object detection model with SwinTransformer-Tiny backbone
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone with SwinTransformer-Tiny
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SwinTransformer_Tiny, []]  # 0 - SwinTransformer backbone
  # SwinTransformer输出多尺度特征，我们直接使用其输出
  - [[], 1, Detect, [nc]] # Detect(P3, P4, P5)